# Created on iPad.
Zero  = ['00000',  # 1行         
'0   0',  # 2行       ,  
'0   0',  # 3行         
'0   0',  # 4行         
'0   0',  # 5行         
'0   0',  # 6行         
'00000']  # 7行
One   = ['  1  ', ' 11  ', '1 1  ', '  1  ', '  1  ', '  1  ', '11111']
Two   = ['22222', '    2', '    2', '22222', '2    ', '2    ', '22222']
Three = ['33333', '    3', '    3', '33333', '    3', '    3', '33333']
Four  = ['  4  ', ' 44  ', '4 4  ', '44444', '  4  ', '  4  ', '  4  ']
Five  = ['55555', '5    ', '5    ', '55555', '    5', '    5', '55555']
Six   = ['66666', '6    ', '6    ', '66666', '6   6', '6   6', '66666']
Seven = ['77777', '    7', '    7', '   7 ', '  7  ', ' 7   ', '7    ']
Eight = ['88888', '8   8', '8   8', '88888', '8   8', '8   8', '88888']
Nine  = ['99999', '9   9', '9   9', '99999', '    9', '    9', '99999']
Digits= [Zero, One, Two, Three, Four, Five, Six, Seven, Eight, Nine]
a=input("请输入一串数字:")
l=len(a)
for k in range(l):    
    if(ord(a[k])<ord('0') or ord(a[k])>ord('9')):        
        print('输入的不是一串有效数字')        
        break
else:    
    for i in range(7):        
        for j in range(l):
            b=Digits[int(a[j])]            
            print(b[i],end=' ')        
        print()